БукмекерскаяКонтора/src/Catalogs/Мероприятия/Мероприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Мероприятия</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БукмекерскаяКонтора/src/Catalogs/Исходы/Исходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Исходы</name>
  <attributes>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.Мероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

БукмекерскаяКонтора/src/Catalogs/Мероприятия/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ДатаНачала < ТекущаяДата()
	Тогда
		Отказ = Истина;
		Сообщить("ДатаНачала мероприятия не может быть раньше текущей");
	КонецЕсли;
	Если не Параметры.Ключ.Пустая() и не Отказ
	Тогда
		РазницаДаты = ТекущийОбъект.ДатаНачала - Параметры.Ключ.ДатаНачала;
		
		Запрос = новый Запрос();
		Запрос.Текст = "Выбрать
		|Исход.Ссылка
		|Из
		|Справочник.Исходы как Исход
		|Где
		|Исход.Мероприятие = &Мероприятие";
		Запрос.УстановитьПараметр("Мероприятие", Параметры.Ключ);
		Исход = Запрос.Выполнить().Выбрать();
		Пока Исход.Следующий() Цикл
			ОбъектИсход = Исход.Ссылка.ПолучитьОбъект();
			ОбъектИсход.Дата = ОбъектИсход.Дата + РазницаДаты;
			ОбъектИсход.Записать();
		КонецЦикла;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуСпискаИсходовМероприятия(Команда)
	Мероприятие = ЭтаФорма.Объект.Ссылка;
	
	ЗначениеОтбора = Новый Структура("Мероприятие", Мероприятие);
	ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);

	ОткрытьФорму("Справочник.Исходы.Форма.ФормаСписка", ПараметрыФормы);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не Параметры.Ключ.Пустая() и Параметры.Ключ.Завершено
	Тогда
		ЭтотОбъект.ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры
